[
  {
    "name": "Deck of Many Things",
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "attunement": "no",
    "suggestedLevel": "17-20",
    "location": "Legendary treasure hoards, planar vaults, fate-touched locations",
    "description": "This infamous collection of cards appears innocuous enough—thin sheets of ivory or vellum bearing intricate illustrations that shift when viewed from different angles. Each card is connected to fundamental forces of reality, and drawing from the deck attracts the attention of cosmic entities.<br><br><strong>Mechanics:</strong> Contains 13 or 22 cards. Before drawing, declare how many cards you intend to draw. Each card has powerful, often permanent effects that can dramatically alter a character's fate.",
    "properties": {
      "Cards": "13 or 22 cards",
      "Danger": "Extremely powerful effects",
      "Single Use": "Each card works once"
    },
    "abilities": [
      {
        "name": "Random Fate",
        "description": "Each card produces powerful effects ranging from beneficial to catastrophic."
      }
    ]
  },
  {
    "name": "Portable Hole",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Dimensional research labs, planar merchants, wizard colleges",
    "description": "This black cloth appears to be a simple handkerchief but unfolds into a six-foot diameter circle. When placed on a solid surface, it creates an extradimensional hole 10 feet deep where items rest in temporal stasis.<br><br><strong>Mechanics:</strong> Unfolds into a 6-foot diameter circle. Creates an extradimensional hole 10 feet deep on a different plane. Cannot create open passages.",
    "properties": {
      "Dimensions": "6 feet diameter, 10 feet deep",
      "Capacity": "Large extradimensional space",
      "Deployment": "Action to unfold and place"
    },
    "abilities": [
      {
        "name": "Extradimensional Space",
        "description": "Creates a hole that exists on another plane of existence."
      }
    ]
  },
  {
    "name": "Cloak of Displacement",
    "type": "Cloak",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Feywild markets, displacer beast lairs, illusion magic academies",
    "description": "This extraordinary garment appears woven from illusion itself, creating a persistent false image of its wearer that appears slightly apart from their true location. The effect makes opponents consistently strike at empty air.<br><br><strong>Mechanics:</strong> Projects an illusion causing creatures to have disadvantage on attack rolls against you. If you take damage, the effect stops until the start of your next turn.",
    "properties": {
      "Defense": "Disadvantage on attacks against you",
      "Disruption": "Stops working when damaged",
      "Recovery": "Reactivates next turn"
    },
    "abilities": [
      {
        "name": "Displacement Illusion",
        "description": "Projects false image of your position, making you harder to hit."
      }
    ]
  },
  {
    "name": "Gauntlets of Ogre Power",
    "type": "Gloves",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Ogre strongholds, strength training facilities, warrior guilds",
    "description": "These massive gauntlets are crafted from thick leather treated with giant sinew oils and etched with primitive runes. When worn, they fundamentally transform the wearer's physical capabilities to supernatural levels.<br><br><strong>Mechanics:</strong> Your Strength score is 19 while you wear these gauntlets. They have no effect if your Strength is already 19 or higher.",
    "properties": {
      "Strength": "Sets to 19",
      "Carrying Capacity": "Greatly increased",
      "Melee Damage": "Improved strength bonus"
    },
    "abilities": [
      {
        "name": "Enhanced Strength",
        "description": "Sets Strength to 19, improving physical capabilities."
      }
    ]
  },
  {
    "name": "Rope of Climbing",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Mountaineer supplies, dungeon explorer kits, thieves' guilds",
    "description": "This sixty-foot length of silk rope possesses an almost serpentine quality, moving with fluid motions and responding to voice commands with eagerness. It can tie itself into any knot and find the safest climbing paths.<br><br><strong>Mechanics:</strong> 60-foot silk rope weighing 3 pounds, holds 3,000 pounds. Speak command word to animate it. Use bonus action to command the other end to move toward a destination.",
    "properties": {
      "Length": "60 feet",
      "Weight Capacity": "3,000 pounds",
      "Control": "Verbal command + bonus action"
    },
    "abilities": [
      {
        "name": "Animate Rope",
        "description": "Rope moves on command, can tie itself and climb surfaces."
      }
    ]
  },
  {
    "name": "Bracers of Defense",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Monk monasteries, unarmored fighter schools, magical academies",
    "description": "These elegant bracers are forged from a mysterious alloy with intricate geometric patterns. They create an invisible field of force that enhances the wearer's natural defensive abilities to superhuman levels.<br><br><strong>Mechanics:</strong> You gain a +2 bonus to AC if you are wearing no armor and using no shield.",
    "properties": {
      "AC Bonus": "+2 (unarmored only)",
      "Restriction": "No armor or shield"
    },
    "abilities": [
      {
        "name": "Unarmored Defense",
        "description": "Provides significant AC bonus for unarmored characters."
      }
    ]
  },
  {
    "name": "Crystal Ball",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes (by a spellcaster)",
    "suggestedLevel": "11-16",
    "location": "Divination towers, oracle temples, fortune teller shops",
    "description": "This perfectly spherical orb of flawless crystal contains swirling silvery mists that reveal images of distant places and people. It acts as a focus for the ancient art of scrying, providing a stable window into the cosmic web.<br><br><strong>Mechanics:</strong> About 6 inches in diameter. While touching it, you can cast the scrying spell (save DC 17) with it.",
    "properties": {
      "Scrying DC": "17",
      "Uses": "Once per day"
    },
    "abilities": [
      {
        "name": "Scrying",
        "description": "Cast Scrying spell once per day to observe distant locations."
      }
    ]
  },
  {
    "name": "Eyes of the Eagle",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Ranger outposts, scout training grounds, eagle aeries",
    "description": "These crystal lenses are cut with precision to focus and intensify light, transforming ordinary vision into something approaching the supernatural sight of hunting birds. They enhance visual processing to predatory levels.<br><br><strong>Mechanics:</strong> Crystal lenses that fit over the eyes. You have advantage on Wisdom (Perception) checks that rely on sight and can make out details of distant objects as small as 2 feet across.",
    "properties": {
      "Perception": "Advantage on sight-based checks",
      "Distance Vision": "See details at extreme range"
    },
    "abilities": [
      {
        "name": "Eagle Vision",
        "description": "Dramatically enhances visual perception and distance sight."
      }
    ]
  },
  {
    "name": "Flamebrand Sword",
    "type": "Weapon",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Fire giant forges, salamander lairs, elemental fire temples",
    "description": "This magnificent longsword has a blade forged from enchanted steel that burns with eternal flames. The crossguard resembles spreading phoenix wings, and the pommel contains a captured fire elemental essence that pulses with inner heat.<br><br><strong>Mechanics:</strong> +1 magic weapon. On a hit, deals an additional 1d6 fire damage. You can use a bonus action to speak the command word and cause flames to wreath the blade for 1 minute, shedding bright light in a 20-foot radius.",
    "properties": {
      "Weapon Type": "Longsword +1",
      "Damage Bonus": "+1d6 fire damage",
      "Light Source": "20-foot bright light when activated"
    },
    "abilities": [
      {
        "name": "Flame Wreath",
        "description": "Bonus action to activate flaming blade that provides light and burns enemies."
      },
      {
        "name": "Fire Resistance",
        "description": "While attuned, you have resistance to fire damage."
      }
    ]
  },
  {
    "name": "Ring of Water Walking",
    "type": "Ring",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Coastal temples, water elemental shrines, merfolk treasuries",
    "description": "This elegant ring is crafted from polished coral and set with a sapphire that constantly swirls with what appears to be trapped seawater. When worn, it grants the wearer supernatural control over their buoyancy and surface tension.<br><br><strong>Mechanics:</strong> While wearing this ring, you can stand and move across any liquid surface as if it were solid ground. This includes water, lava, acid, and other liquids.",
    "properties": {
      "Surface Walking": "Walk on any liquid",
      "No Concentration": "Always active while worn",
      "Weight Limit": "Normal carrying capacity applies"
    },
    "abilities": [
      {
        "name": "Liquid Surface Traversal",
        "description": "Move across any liquid surface as if it were solid ground."
      }
    ]
  },
  {
    "name": "Boots of Elvenkind",
    "type": "Boots",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Elven courts, forest ranger outposts, fey crossing points",
    "description": "These soft leather boots are crafted from the hide of a celestial deer and stitched with thread spun from moonbeams. They mold perfectly to the wearer's feet and seem to anticipate every step, allowing movement with supernatural grace and silence.<br><br><strong>Mechanics:</strong> While wearing these boots, your steps make no sound, and you have advantage on Dexterity (Stealth) checks that rely on moving silently.",
    "properties": {
      "Stealth Bonus": "Advantage on silent movement",
      "Sound Dampening": "Footsteps make no noise",
      "Comfort": "Never cause fatigue from walking"
    },
    "abilities": [
      {
        "name": "Silent Steps",
        "description": "Move without making any sound with your footsteps."
      }
    ]
  },
  {
    "name": "Amulet of the Planes",
    "type": "Amulet",
    "rarity": "Very Rare",
    "attunement": "yes",
    "suggestedLevel": "11-16",
    "location": "Planar research institutes, ancient wizard towers, extraplanar markets",
    "description": "This complex amulet consists of multiple rotating rings of different metals, each inscribed with symbols representing various planes of existence. At its center lies a small sphere that shifts between different materials - sometimes crystal, sometimes metal, sometimes pure energy.<br><br><strong>Mechanics:</strong> While wearing this amulet, you can use an action to name a location on another plane of existence and cast the plane shift spell. Once used, this property can't be used again until the next dawn.",
    "properties": {
      "Plane Shift": "Cast once per day",
      "No Spell Slot": "Doesn't require spell slots",
      "Target Selection": "Can target specific locations"
    },
    "abilities": [
      {
        "name": "Planar Travel",
        "description": "Cast plane shift spell once per day to travel between planes."
      },
      {
        "name": "Planar Awareness",
        "description": "Always know which plane of existence you're currently on."
      }
    ]
  },
  {
    "name": "Staff of the Python",
    "type": "Staff",
    "rarity": "Uncommon",
    "attunement": "yes (by a spellcaster)",
    "suggestedLevel": "5-10",
    "location": "Yuan-ti temples, druid groves, serpent cult sanctuaries",
    "description": "This staff is carved from a single piece of ancient ironwood and shaped to resemble a coiled serpent. The head of the staff features intricate scales and ruby eyes that seem to watch the surroundings with predatory intelligence.<br><br><strong>Mechanics:</strong> You can use an action to speak the command word and throw the staff on the ground within 10 feet. The staff becomes a giant constrictor snake under your control and acts on its own initiative count.",
    "properties": {
      "Transformation": "Becomes giant constrictor snake",
      "Control": "Snake obeys your commands",
      "Duration": "1 hour or until reduced to 0 hit points"
    },
    "abilities": [
      {
        "name": "Serpent Form",
        "description": "Transform staff into a loyal giant constrictor snake for 1 hour."
      },
      {
        "name": "Mental Link",
        "description": "Telepathically command the snake while it's within 60 feet."
      }
    ]
  },
  {
    "name": "Wand of Magic Missiles",
    "type": "Wand",
    "rarity": "Uncommon",
    "attunement": "yes (by a spellcaster)",
    "suggestedLevel": "1-4",
    "location": "Magic item shops, wizard academies, battle mage armories",
    "description": "This slender wand is crafted from polished oak and tipped with a small crystal that pulses with arcane energy. Carved along its length are tiny runes that glow softly when the wand is charged with magical power.<br><br><strong>Mechanics:</strong> This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the magic missile spell. For 1 charge, you cast the 1st-level version. You can increase the spell slot level by one for each additional charge.",
    "properties": {
      "Charges": "7 charges",
      "Recharge": "1d6+1 charges at dawn",
      "Spell Level": "1st level + additional charges"
    },
    "abilities": [
      {
        "name": "Magic Missile",
        "description": "Cast magic missile spell using charges to determine spell level."
      }
    ]
  },
  {
    "name": "Bag of Tricks",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Traveling merchant caravans, circus troupes, trickster deity shrines",
    "description": "This ordinary-looking gray bag is made from soft cloth and appears unremarkable at first glance. However, when opened, it reveals a swirling void of grey mist. The bag contains an extradimensional space connected to the Feywild, where various woodland creatures wait to be summoned.<br><br><strong>Mechanics:</strong> You can use an action to pull a fuzzy object from the bag and throw it 20 feet. The object transforms into a random beast (roll d8) that is friendly to you and your companions.",
    "properties": {
      "Uses": "3 times per day",
      "Random Animals": "Roll d8 for creature type",
      "Duration": "Animals last 10 minutes"
    },
    "abilities": [
      {
        "name": "Summon Beast",
        "description": "Pull out a random friendly animal that helps you for 10 minutes."
      }
    ]
  },
  {
    "name": "Potion of Giant Strength",
    "type": "Potion",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Giant strongholds, alchemist laboratories, strength-based training grounds",
    "description": "This thick, crimson potion swirls with golden flecks that seem to pulse with inner power. The liquid has the consistency of honey and emanates a faint warmth. When consumed, it temporarily grants the drinker the legendary strength of giants.<br><br><strong>Mechanics:</strong> When you drink this potion, your Strength score changes to 23 for 1 hour. The potion has no effect if your Strength is equal to or greater than 23.",
    "properties": {
      "Strength Score": "Sets to 23",
      "Duration": "1 hour",
      "Single Use": "Consumed when used"
    },
    "abilities": [
      {
        "name": "Giant's Might",
        "description": "Temporarily gain the incredible strength of giants."
      }
    ]
  },
  {
    "name": "Helm of Telepathy",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Psionicist academies, mind flayer ruins, telepathic research facilities",
    "description": "This ornate helmet is crafted from silvered steel and adorned with intricate engravings of spiraling patterns that seem to shift when viewed directly. A large amethyst crystal is embedded in the center of the forehead plate, pulsing gently with psychic energy.<br><br><strong>Mechanics:</strong> While wearing this helm, you can use an action to cast the detect thoughts spell (save DC 13). Once used, this property can't be used again until the next dawn.",
    "properties": {
      "Detect Thoughts": "Cast once per day",
      "Save DC": "13",
      "Range": "30 feet"
    },
    "abilities": [
      {
        "name": "Mind Reading",
        "description": "Cast detect thoughts spell to read surface thoughts of creatures."
      },
      {
        "name": "Telepathic Communication",
        "description": "Communicate telepathically with any creature within 30 feet that knows a language."
      }
    ]
  },
  {
    "name": "Shield of Missile Attraction",
    "type": "Shield",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Cursed armories, battlefield ruins, trickster god temples",
    "description": "This polished steel shield bears an elaborate design of arrows, bolts, and other projectiles carved into its surface. The metal has an unusual lustrous quality that seems to draw the eye - and unfortunately, incoming missiles as well. While protective, it comes with an unexpected drawback.<br><br><strong>Mechanics:</strong> +2 magic shield. Cursed: While holding this shield, you have disadvantage on Dexterity saving throws, and ranged weapon attacks against you are made with advantage.",
    "properties": {
      "AC Bonus": "+2 shield bonus",
      "Curse": "Attracts ranged attacks",
      "Dexterity Penalty": "Disadvantage on Dex saves"
    },
    "abilities": [
      {
        "name": "Enhanced Protection",
        "description": "Provides superior shield protection with +2 AC bonus."
      },
      {
        "name": "Missile Magnet (Curse)",
        "description": "Draws ranged attacks and impedes agility. Requires remove curse to unequip."
      }
    ]
  },
  {
    "name": "Hammer of the Forge Master",
    "type": "Weapon",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Master blacksmith workshops, dwarven forge guilds, fire giant smithies",
    "description": "This magnificent warhammer doubles as both weapon and crafting tool. Forged from meteoric iron and blessed by the forge gods, its head bears intricate runes that glow with inner fire when striking metal. The handle is wrapped in dragonhide leather that never burns.<br><br><strong>Mechanics:</strong> +1 magic weapon that also functions as masterwork smith's tools. While using this hammer for crafting, you have advantage on all ability checks related to metalworking and reduce crafting time by half.",
    "properties": {
      "Weapon Type": "Warhammer +1",
      "Tool Proficiency": "Counts as smith's tools",
      "Crafting Speed": "Half normal time for metalwork"
    },
    "abilities": [
      {
        "name": "Perfect Strike",
        "description": "Advantage on all metalworking ability checks when used as a crafting tool."
      },
      {
        "name": "Forge Blessing",
        "description": "Items crafted with this hammer gain +1 to durability and quality."
      }
    ]
  },
  {
    "name": "Bellows of Endless Wind",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Blacksmith shops, artificer workshops, elemental air shrines",
    "description": "These leather bellows are reinforced with bands of enchanted steel and connected to a small air elemental bound within. They never require manual pumping and can maintain any desired temperature in a forge indefinitely.<br><br><strong>Mechanics:</strong> When attached to a forge, these bellows automatically maintain optimal airflow. The forge reaches desired temperatures in half the normal time and maintains perfect heat without attention.",
    "properties": {
      "Automatic Operation": "No manual pumping required",
      "Heat Control": "Precise temperature maintenance",
      "Efficiency": "Halves heating time"
    },
    "abilities": [
      {
        "name": "Perpetual Airflow",
        "description": "Provides continuous, controlled air supply to any forge."
      },
      {
        "name": "Temperature Mastery",
        "description": "Maintains exact forge temperatures without fluctuation."
      }
    ]
  },
  {
    "name": "Anvil of True Shaping",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes",
    "suggestedLevel": "11-16",
    "location": "Legendary smithies, dwarven clan treasuries, divine forge chambers",
    "description": "This massive anvil is carved from a single block of adamantine and inscribed with creation runes in every known language. It radiates an aura of perfect craftsmanship and seems to guide the smith's hand toward ideal forms.<br><br><strong>Mechanics:</strong> When working at this anvil, all metalworking checks are made with advantage, and you can attempt to craft items that would normally be beyond your skill level. Once per day, you can automatically succeed on one crafting check.",
    "properties": {
      "Material": "Pure adamantine construction",
      "Skill Enhancement": "Advantage on all metalworking",
      "Perfect Creation": "One automatic success per day"
    },
    "abilities": [
      {
        "name": "Master's Guidance",
        "description": "Advantage on all metalworking checks and ability to craft beyond normal skill level."
      },
      {
        "name": "Flawless Strike",
        "description": "Once per day, automatically succeed on any crafting ability check."
      }
    ]
  },
  {
    "name": "Tongs of Elemental Grasping",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Elemental forges, magical smithies, artificer colleges",
    "description": "These masterwork tongs are crafted from enchanted steel with grips wrapped in salamander leather. They can safely handle any material regardless of temperature and seem to anticipate the smith's needs.<br><br><strong>Mechanics:</strong> These tongs can safely grasp and manipulate any material, regardless of temperature, magical properties, or hazardous nature. They extend your reach by 5 feet when crafting.",
    "properties": {
      "Temperature Immunity": "Handle any heat or cold",
      "Magic Resistance": "Safely manipulate magical materials",
      "Extended Reach": "5 feet additional range"
    },
    "abilities": [
      {
        "name": "Universal Grip",
        "description": "Safely handle any material regardless of temperature or magical properties."
      },
      {
        "name": "Precise Control",
        "description": "Gain fine manipulation abilities even with extremely hot or dangerous materials."
      }
    ]
  },
  {
    "name": "Apron of the Forge Guardian",
    "type": "Armor",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Master smiths' personal gear, forge safety equipment vendors, fire giant workshops",
    "description": "This heavy leather apron is reinforced with overlapping scales of red dragon hide and blessed with protective ward runes. It provides both physical protection and magical defenses specifically tailored for forge work.<br><br><strong>Mechanics:</strong> While wearing this apron, you have resistance to fire damage and advantage on saving throws against effects that would damage or destroy crafted items. AC 12 + Dex modifier (max 2).",
    "properties": {
      "AC": "12 + Dex modifier (max 2)",
      "Fire Resistance": "Resistance to fire damage",
      "Craft Protection": "Advantage on saves to protect crafted items"
    },
    "abilities": [
      {
        "name": "Forge Ward",
        "description": "Resistance to fire damage and protection from forge-related hazards."
      },
      {
        "name": "Artisan's Shield",
        "description": "Magical protection extends to items you're crafting, preventing damage from accidents."
      }
    ]
  },
  {
    "name": "Crucible of Infinite Metals",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes",
    "suggestedLevel": "11-16",
    "location": "Legendary smithies, planar trading posts, elemental earth temples",
    "description": "This large crucible appears to be made of dark volcanic glass but is actually forged from crystallized earth elemental essence. When activated, it can produce any common metal in unlimited quantities, and rare metals in limited amounts.<br><br><strong>Mechanics:</strong> Once per day, you can command the crucible to produce up to 100 pounds of common metals (iron, copper, tin) or 10 pounds of uncommon metals (silver, gold, platinum) or 1 pound of rare metals (mithril, adamantine).",
    "properties": {
      "Common Metals": "100 pounds per day",
      "Uncommon Metals": "10 pounds per day",
      "Rare Metals": "1 pound per day"
    },
    "abilities": [
      {
        "name": "Metal Creation",
        "description": "Generate any type of metal based on rarity limits once per day."
      },
      {
        "name": "Pure Quality",
        "description": "All metals produced are of perfect purity and quality."
      }
    ]
  },
  {
    "name": "Quenching Basin of Perfect Cooling",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Professional smithies, weapon crafting guilds, magical tool vendors",
    "description": "This wide stone basin is carved from a single piece of glacier ice that never melts. The water within remains at the perfect temperature for quenching any metal, automatically adjusting to provide optimal cooling rates.<br><br><strong>Mechanics:</strong> Any metal item quenched in this basin is cooled at the perfect rate, preventing warping, cracking, or other cooling-related defects. Items quenched here gain +1 to durability.",
    "properties": {
      "Perfect Temperature": "Optimal cooling for any metal",
      "Defect Prevention": "No cooling-related flaws",
      "Durability Bonus": "+1 to item durability"
    },
    "abilities": [
      {
        "name": "Optimal Quenching",
        "description": "Provides perfect cooling rates to prevent defects in crafted items."
      },
      {
        "name": "Enhanced Durability",
        "description": "Items quenched here are more resistant to wear and damage."
      }
    ]
  },
  {
    "name": "Lens of Flaw Detection",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Quality control stations, master craftsmen's tools, artificer laboratories",
    "description": "This crystal magnifying lens is ground from pure divination crystal and set in a frame of enchanted silver. When looking through it, even the smallest imperfections in crafted items become clearly visible as glowing lines of colored light.<br><br><strong>Mechanics:</strong> While looking through this lens, you can instantly detect any flaws, weaknesses, or defects in crafted items. You gain advantage on Intelligence (Investigation) checks to assess item quality and can determine an item's exact durability and structural integrity.",
    "properties": {
      "Flaw Detection": "Reveals all structural defects",
      "Quality Assessment": "Determines exact item condition",
      "Investigation Bonus": "Advantage on quality checks"
    },
    "abilities": [
      {
        "name": "Perfect Vision",
        "description": "See through illusions and detect any hidden flaws in crafted items."
      },
      {
        "name": "Structural Analysis",
        "description": "Instantly understand the complete structural integrity of any item."
      }
    ]
  },
  {
    "name": "Gloves of Steady Hands",
    "type": "Gloves",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Fine craftsmen's workshops, jeweler's guilds, precision tool vendors",
    "description": "These supple leather gloves are stitched with silver thread in intricate patterns that seem to stabilize the wearer's movements. Tiny gems embedded in the fingertips pulse with a calming magical aura.<br><br><strong>Mechanics:</strong> While wearing these gloves, your hands never shake or tremble, and you have advantage on all Dexterity-based ability checks involving fine motor control, including crafting delicate items.",
    "properties": {
      "Hand Stability": "Eliminates hand tremors",
      "Fine Control": "Advantage on delicate work",
      "Precision Crafting": "Enhanced accuracy for detailed work"
    },
    "abilities": [
      {
        "name": "Unwavering Precision",
        "description": "Advantage on all Dexterity checks requiring fine motor control."
      },
      {
        "name": "Artisan's Grace",
        "description": "Can work on extremely delicate projects without risk of accidental damage."
      }
    ]
  },
  {
    "name": "Forge of Endless Flame",
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "attunement": "yes",
    "suggestedLevel": "17-20",
    "location": "Divine smithies, primordial fire temples, legendary craftsmen's workshops",
    "description": "This massive forge appears to contain a captive star at its heart, burning with flames that have never been extinguished since the dawn of creation. The fire within burns at any desired temperature and can smelt any known material.<br><br><strong>Mechanics:</strong> This forge burns eternally without fuel and can reach any temperature instantly. It can smelt any material, including magical metals and extraplanar substances. Items forged here gain a permanent +1 enhancement bonus and count as magical.",
    "properties": {
      "Eternal Flame": "Burns forever without fuel",
      "Infinite Temperature": "Can reach any heat level",
      "Universal Smelting": "Can work any material"
    },
    "abilities": [
      {
        "name": "Divine Crafting",
        "description": "All items forged here automatically gain +1 enhancement and magical properties."
      },
      {
        "name": "Planar Metallurgy",
        "description": "Can work with materials from any plane of existence."
      },
      {
        "name": "Masterwork Creation",
        "description": "Once per month, can create an item of up to Very Rare quality."
      }
    ]
  },
  {
    "name": "Mirror of Past Reflections",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Ancient libraries, divination towers, historian's studies",
    "description": "This ornate hand mirror has a frame of tarnished silver engraved with swirling temporal runes. Its surface shows not your current reflection, but glimpses of your past selves and the echoes of events that occurred in its presence.<br><br><strong>Mechanics:</strong> Once per day, you can gaze into the mirror and witness any event that occurred within 30 feet of the mirror's current location within the past 24 hours, viewing it as if you were present.",
    "properties": {
      "Temporal Range": "Past 24 hours",
      "Viewing Area": "30-foot radius from mirror",
      "Duration": "Up to 10 minutes of viewing"
    },
    "abilities": [
      {
        "name": "Historical Sight",
        "description": "View any event that occurred near the mirror within the past day."
      },
      {
        "name": "Past Self Glimpses",
        "description": "Occasionally see reflections of your past experiences and decisions."
      }
    ]
  },
  {
    "name": "Cloak of Many Fashions",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Fashion boutiques, noble courts, theatrical costume shops",
    "description": "This remarkable garment appears to be a simple traveling cloak, but its fabric shimmers with subtle magical threads. At the wearer's command, it can transform into any style of clothing appropriate for any social situation or climate.<br><br><strong>Mechanics:</strong> As an action, you can command the cloak to change into any set of clothing, from peasant garb to noble finery. The clothing is always perfectly fitted and appropriate for the current weather.",
    "properties": {
      "Instant Transformation": "Change to any clothing style",
      "Perfect Fit": "Always sized correctly",
      "Climate Adaptation": "Adjusts for weather conditions"
    },
    "abilities": [
      {
        "name": "Fashion Transformation",
        "description": "Transform into any style of clothing from any culture or social class."
      },
      {
        "name": "Social Camouflage",
        "description": "Gain advantage on Charisma (Deception) checks to blend into social situations."
      }
    ]
  },
  {
    "name": "Candle of Truth Telling",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Courtrooms, interrogation chambers, temples of justice",
    "description": "This white candle is made from the rendered fat of a celestial creature and burns with a pure, steady flame that never flickers. Its light has the power to compel honesty from those within its illumination.<br><br><strong>Mechanics:</strong> When lit, creatures within 10 feet of the candle must make a Wisdom saving throw (DC 13) when they attempt to tell a deliberate lie. On a failure, they must speak the truth or remain silent.",
    "properties": {
      "Truth Radius": "10 feet from candle",
      "Save DC": "Wisdom DC 13",
      "Burn Duration": "8 hours per lighting"
    },
    "abilities": [
      {
        "name": "Compel Truth",
        "description": "Forces creatures to make saves when attempting to lie in the candle's light."
      },
      {
        "name": "Detect Deception",
        "description": "The flame flickers and dims when someone successfully lies nearby."
      }
    ]
  },
  {
    "name": "Bottle of Boundless Air",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Underwater ruins, air elemental shrines, deep mining operations",
    "description": "This crystal bottle contains what appears to be ordinary air, but it holds an extradimensional pocket connected to the Elemental Plane of Air. The bottle never empties and provides an unlimited supply of fresh, breathable air.<br><br><strong>Mechanics:</strong> You can drink from this bottle to breathe normally in any environment for 1 hour. Multiple creatures can share the air by each taking a drink. The bottle refills instantly after each use.",
    "properties": {
      "Air Duration": "1 hour per drink",
      "Unlimited Uses": "Never empties",
      "Universal Breathing": "Works in any environment"
    },
    "abilities": [
      {
        "name": "Eternal Breath",
        "description": "Provides breathable air in any environment, including underwater or in toxic atmospheres."
      },
      {
        "name": "Shared Respiration",
        "description": "Multiple creatures can benefit by each taking a drink from the bottle."
      }
    ]
  },
  {
    "name": "Compass of Desire",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Treasure hunter guilds, explorer's societies, wish-granting locations",
    "description": "This brass compass has an ornate face inscribed with symbols representing various desires and needs. Instead of pointing north, its needle points toward whatever the attuned user most desires at the moment.<br><br><strong>Mechanics:</strong> While holding the compass, you can concentrate on something you desire. The needle will point in the direction of the closest example of that thing within 1 mile, if one exists.",
    "properties": {
      "Detection Range": "1 mile radius",
      "Desire Tracking": "Points to whatever you most want",
      "Concentration": "Requires focus to specify target"
    },
    "abilities": [
      {
        "name": "Heart's Direction",
        "description": "Points toward whatever you most desire within range."
      },
      {
        "name": "Specific Seeking",
        "description": "Can focus on particular objects, people, or concepts when concentrating."
      }
    ]
  },
  {
    "name": "Tankard of Endless Ale",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Taverns, breweries, dwarven halls, festival grounds",
    "description": "This sturdy pewter tankard is etched with images of hops, barley, and singing dwarves. No matter how much you drink from it, it always remains full of perfectly crafted ale that matches the drinker's preferred taste.<br><br><strong>Mechanics:</strong> This tankard always contains fresh, high-quality ale that tastes exactly how the current drinker prefers. The ale provides the same nourishment as food and water for one meal per day.",
    "properties": {
      "Infinite Ale": "Never empties",
      "Perfect Taste": "Matches drinker's preferences",
      "Nutritional Value": "Counts as one meal per day"
    },
    "abilities": [
      {
        "name": "Endless Refreshment",
        "description": "Provides unlimited ale that perfectly matches the drinker's taste preferences."
      },
      {
        "name": "Sustaining Brew",
        "description": "The magical ale can substitute for one meal per day when consumed."
      }
    ]
  },
  {
    "name": "Bed of Restful Sleep",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Luxury inns, healing temples, noble bedchambers, rest shrines",
    "description": "This comfortable bed appears to be made of the finest materials, with a mattress that perfectly conforms to any sleeper. The bed radiates an aura of peace and tranquility that promotes deep, restorative sleep.<br><br><strong>Mechanics:</strong> Anyone who sleeps in this bed for at least 4 hours gains the benefits of a long rest. Additionally, they recover from one level of exhaustion and gain temporary hit points equal to their level that last until their next long rest.",
    "properties": {
      "Accelerated Rest": "Long rest in 4 hours",
      "Exhaustion Recovery": "Remove one exhaustion level",
      "Temporary HP": "Gain temp HP equal to level"
    },
    "abilities": [
      {
        "name": "Perfect Rest",
        "description": "Provides complete rest benefits in half the normal time."
      },
      {
        "name": "Rejuvenating Dreams",
        "description": "Sleep grants additional healing and removes exhaustion."
      }
    ]
  },
  {
    "name": "Jar of Preserving",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Alchemist shops, food storage facilities, preservation labs",
    "description": "This large glass jar has an airtight lid inscribed with preservation runes. Anything placed inside enters a state of temporal stasis, remaining exactly as it was when sealed, regardless of how much time passes.<br><br><strong>Mechanics:</strong> Any organic matter placed in this jar stops aging, decaying, or changing in any way. Food remains fresh, wounds don't heal or worsen, and even living creatures enter suspended animation.",
    "properties": {
      "Time Stasis": "Stops all aging and decay",
      "Capacity": "Holds up to 1 cubic foot",
      "Universal Preservation": "Works on any organic matter"
    },
    "abilities": [
      {
        "name": "Temporal Suspension",
        "description": "Places any organic matter in complete temporal stasis."
      },
      {
        "name": "Perfect Preservation",
        "description": "Prevents all forms of deterioration, aging, or change."
      }
    ]
  },
  {
    "name": "Book of Endless Stories",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Grand libraries, storyteller guilds, entertainment venues, bardic colleges",
    "description": "This leather-bound tome appears to contain only blank pages at first glance, but when opened with intent, it fills with whatever story the reader most wants to experience. The words and illustrations move and change as the tale unfolds.<br><br><strong>Mechanics:</strong> Once per day, you can open the book and experience any story you desire. While reading, you gain inspiration and advantage on your next ability check, attack roll, or saving throw.",
    "properties": {
      "Story Generation": "Creates any story on demand",
      "Interactive Reading": "Words and images move on pages",
      "Inspiration Gain": "Provides mechanical benefits"
    },
    "abilities": [
      {
        "name": "Living Literature",
        "description": "Generates any story you wish to read with moving text and illustrations."
      },
      {
        "name": "Inspiring Tales",
        "description": "Reading grants inspiration and advantage on your next d20 roll."
      }
    ]
  },
  {
    "name": "Cloak of Useful Things",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Utility shops, adventurer outfitters, practical magic vendors",
    "description": "This practical brown cloak has dozens of small pockets and patches sewn into its inner lining. Each patch can be pulled off to reveal a common item that might be needed in everyday situations.<br><br><strong>Mechanics:</strong> Three times per day, you can pull a patch from the cloak to produce any common, mundane item worth 1 gp or less (rope, candle, chalk, etc.). The cloak regrows these patches at dawn.",
    "properties": {
      "Item Value": "Up to 1 gold piece",
      "Daily Uses": "3 patches per day",
      "Regeneration": "Patches regrow at dawn"
    },
    "abilities": [
      {
        "name": "Mundane Creation",
        "description": "Produce any common item worth 1 gp or less from the cloak's patches."
      },
      {
        "name": "Daily Renewal",
        "description": "The cloak regenerates its magical patches each dawn."
      }
    ]
  },
  {
    "name": "Stone of Gravity Control",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes",
    "suggestedLevel": "11-16",
    "location": "Floating cities, gravity research labs, elemental earth temples",
    "description": "This smooth, spherical stone appears to be made of condensed starlight and feels surprisingly heavy for its size. It pulses with gravitational energy and allows the wielder to manipulate gravitational forces in localized areas.<br><br><strong>Mechanics:</strong> As an action, you can alter gravity in a 30-foot radius centered on you for 1 minute. You can make gravity lighter (creatures can jump twice as far), heavier (movement speed halved), or reversed (creatures fall upward). Usable once per long rest.",
    "properties": {
      "Gravity Radius": "30-foot area of effect",
      "Duration": "1 minute",
      "Gravity Options": "Lighter, heavier, or reversed"
    },
    "abilities": [
      {
        "name": "Gravitational Manipulation",
        "description": "Alter gravity effects in a large area for tactical advantage."
      },
      {
        "name": "Directional Control",
        "description": "Can reverse gravity to make creatures and objects fall upward."
      }
    ]
  },
  {
    "name": "Lantern of Revealing Light",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Investigation bureaus, guard stations, truth-seeking temples",
    "description": "This brass lantern burns with a clear, white flame that illuminates more than just the physical world. Its light reveals hidden truths and exposes that which is concealed from normal sight.<br><br><strong>Mechanics:</strong> While lit, this lantern's light reveals invisible creatures and objects, illusions appear translucent, and hidden doors or compartments glow with a faint outline within its 30-foot radius of bright light.",
    "properties": {
      "Light Radius": "30 feet bright, 30 feet dim",
      "Revelation Range": "Affects all within bright light",
      "Truth Detection": "Reveals hidden and false things"
    },
    "abilities": [
      {
        "name": "True Sight Illumination",
        "description": "Reveals invisible creatures, hidden objects, and makes illusions translucent."
      },
      {
        "name": "Secret Detection",
        "description": "Hidden doors, compartments, and passages glow with faint outlines."
      }
    ]
  },
  {
    "name": "Coin of Fate's Fortune",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Gambling houses, fate temples, luck shrines, chance encounters",
    "description": "This golden coin bears the image of a smiling face on one side and a frowning face on the other. It feels warm to the touch and seems to pulse with the rhythm of destiny itself.<br><br><strong>Mechanics:</strong> Once per day, you can flip this coin before making an attack roll, ability check, or saving throw. Call heads or tails - if you guess correctly, you have advantage on the roll. If wrong, you have disadvantage.",
    "properties": {
      "Daily Use": "Once per day",
      "Luck Gamble": "Advantage or disadvantage based on guess",
      "Fate Connection": "Tied to destiny and chance"
    },
    "abilities": [
      {
        "name": "Fortune's Gamble",
        "description": "Risk disadvantage for the chance of advantage on important rolls."
      },
      {
        "name": "Destiny's Call",
        "description": "The coin seems to influence fate itself when flipped."
      }
    ]
  },
  {
    "name": "Box of Infinite Scrolls",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes (by a spellcaster)",
    "suggestedLevel": "11-16",
    "location": "Ancient libraries, wizard towers, magical archives, scribal academies",
    "description": "This ornate wooden box is inlaid with silver runes and contains an extradimensional space filled with magical scrolls. The box somehow anticipates the user's needs and produces relevant scrolls when opened.<br><br><strong>Mechanics:</strong> Once per day, you can open the box and find a spell scroll of a spell you know of 3rd level or lower. Once per week, you can find a scroll of a 4th or 5th level spell you know.",
    "properties": {
      "Daily Scroll": "3rd level or lower",
      "Weekly Scroll": "4th or 5th level",
      "Known Spells Only": "Must be spells you know"
    },
    "abilities": [
      {
        "name": "Responsive Archive",
        "description": "Produces spell scrolls of spells you know when you need them most."
      },
      {
        "name": "Anticipatory Magic",
        "description": "The box seems to predict which scrolls will be most useful."
      }
    ]
  },
  {
    "name": "Carpet of Comfort",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Nomad camps, traveling merchants, comfort item vendors",
    "description": "This richly woven carpet displays intricate patterns that seem to shift and flow when viewed from different angles. When laid out, it creates a zone of perfect comfort regardless of the surrounding environment.<br><br><strong>Mechanics:</strong> When spread out, this 10-foot by 10-foot carpet creates a zone where the temperature is always comfortable, the ground is soft, and light rain or snow doesn't penetrate. Sleeping on it provides all the comfort of a fine bed.",
    "properties": {
      "Coverage": "10x10 foot area",
      "Climate Control": "Perfect temperature",
      "Weather Protection": "Blocks light precipitation"
    },
    "abilities": [
      {
        "name": "Environmental Comfort",
        "description": "Creates a zone of perfect climate and comfort in any environment."
      },
      {
        "name": "Restful Surface",
        "description": "Provides the comfort of a luxurious bed anywhere it's placed."
      }
    ]
  },
  {
    "name": "Prism of Light Splitting",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Optical laboratories, light temples, rainbow bridges, crystal caves",
    "description": "This perfectly cut crystal prism refracts light in impossible ways, creating rainbows that seem to exist in three dimensions. It can separate not just light but also magical energies and effects.<br><br><strong>Mechanics:</strong> As an action, you can point the prism at a spell effect or magical aura and split it into component parts. This allows you to redirect half of a spell's effect to a different target, or separate beneficial effects from harmful ones.",
    "properties": {
      "Spell Splitting": "Divide magical effects",
      "Redirection": "Change targets of split effects",
      "Light Manipulation": "Creates spectacular light displays"
    },
    "abilities": [
      {
        "name": "Magic Refraction",
        "description": "Split spell effects and redirect portions to different targets."
      },
      {
        "name": "Effect Separation",
        "description": "Separate beneficial effects from harmful ones in complex spells."
      }
    ]
  },
  {
    "name": "Hourglass of Borrowed Time",
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "attunement": "yes",
    "suggestedLevel": "11-16",
    "location": "Time research facilities, temporal anomalies, chronomancer towers",
    "description": "This elegant hourglass contains sand that flows upward and downward simultaneously in an impossible display of temporal manipulation. The sand seems to sparkle with captured moments from across time.<br><br><strong>Mechanics:</strong> Once per long rest, you can flip the hourglass to gain an extra action on your turn for the next minute. However, after the effect ends, you are stunned for one round as time catches up with you.",
    "properties": {
      "Extra Action": "Additional action each turn",
      "Duration": "1 minute",
      "Consequence": "Stunned for 1 round afterward"
    },
    "abilities": [
      {
        "name": "Temporal Acceleration",
        "description": "Gain an extra action each turn for one minute."
      },
      {
        "name": "Time Debt",
        "description": "Must pay the price of borrowed time with temporary stunning."
      }
    ]
  },
  {
    "name": "Paintbrush of Living Art",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Artist studios, creative academies, imagination workshops, fey galleries",
    "description": "This fine paintbrush has bristles made from phoenix feathers and a handle carved from a treant's branch. Whatever it paints becomes temporarily real, bringing imagination into physical existence.<br><br><strong>Mechanics:</strong> You can paint simple objects or creatures on any surface. These paintings become real for 1 hour, with the limitations that they can't be larger than Medium size and can't have more than 2 hit dice. Usable once per day.",
    "properties": {
      "Size Limit": "Medium or smaller",
      "Complexity": "Maximum 2 hit dice",
      "Duration": "1 hour"
    },
    "abilities": [
      {
        "name": "Artistic Creation",
        "description": "Paint objects or simple creatures that become temporarily real."
      },
      {
        "name": "Imagination Manifestation",
        "description": "Bring your artistic vision into physical reality for a limited time."
      }
    ]
  },
  {
    "name": "Keyring of Universal Access",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Locksmith guilds, thieves' dens, security companies, master key vaults",
    "description": "This simple iron keyring holds exactly seven keys that constantly shift and change their shapes. Each key can transform to open any lock, though each has its own personality and preferences for certain types of barriers.<br><br><strong>Mechanics:</strong> As an action, you can select one key to attempt to open any lock. Make a Dexterity check with proficiency bonus, adding different modifiers based on which key you choose (+1 to +5 depending on lock complexity).",
    "properties": {
      "Universal Keys": "7 keys that reshape themselves",
      "Proficiency Bonus": "Always add proficiency to checks",
      "Variable Bonuses": "+1 to +5 based on key chosen"
    },
    "abilities": [
      {
        "name": "Adaptive Unlocking",
        "description": "Keys reshape themselves to fit any lock mechanism."
      },
      {
        "name": "Master Access",
        "description": "Different keys provide different bonuses for various types of locks."
      }
    ]
  },
  {
    "name": "Satchel of Endless Provision",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Traveling supply stores, expedition outfitters, survival gear vendors",
    "description": "This worn leather satchel appears ordinary but contains an extradimensional space connected to a realm of infinite basic supplies. It can provide essential items for survival and daily life.<br><br><strong>Mechanics:</strong> Three times per day, you can reach into the satchel and pull out any basic survival item worth 5 sp or less (rations, rope, blanket, torch, etc.). The items are mundane but perfectly functional.",
    "properties": {
      "Item Value": "5 silver pieces or less",
      "Daily Uses": "3 items per day",
      "Survival Focus": "Basic necessities only"
    },
    "abilities": [
      {
        "name": "Survival Provision",
        "description": "Provides basic survival items when needed most."
      },
      {
        "name": "Endless Supply",
        "description": "Never runs out of basic necessities for adventuring."
      }
    ]
  },
  {
    "name": "Boots of Mud Walking",
    "type": "Boots",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Swamp villages, marsh ranger outposts, bog witch huts",
    "description": "These sturdy leather boots are treated with oils from bog moss and sealed with waterproof wax. They allow the wearer to traverse muddy, swampy terrain with ease, never getting stuck or slipping.<br><br><strong>Mechanics:</strong> While wearing these boots, you ignore difficult terrain caused by mud, swamp water, or similar wet, soft ground. You also have advantage on saving throws against being knocked prone on such terrain.",
    "properties": {
      "Terrain Immunity": "Ignore mud/swamp difficult terrain",
      "Stability": "Advantage vs prone on wet ground",
      "Waterproof": "Feet stay completely dry"
    },
    "abilities": [
      {
        "name": "Swamp Stride",
        "description": "Move normally through muddy and swampy terrain without impediment."
      },
      {
        "name": "Sure Footing",
        "description": "Advantage on saves against being knocked prone on wet, muddy surfaces."
      }
    ]
  },
  {
    "name": "Cloak of Billowing",
    "type": "Cloak",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Theatrical costume shops, dramatic performer guilds, vanity merchants",
    "description": "This dramatic cloak is made from fine silk that catches the wind in the most flattering ways. It always billows heroically behind the wearer, creating an impressive silhouette regardless of wind conditions.<br><br><strong>Mechanics:</strong> The cloak billows dramatically on command (no action required). While billowing, you have advantage on Charisma (Intimidation) and Charisma (Performance) checks. The effect is purely cosmetic but psychologically impactful.",
    "properties": {
      "Dramatic Effect": "Always billows impressively",
      "Intimidation Bonus": "Advantage when billowing",
      "Performance Bonus": "Advantage on dramatic displays"
    },
    "abilities": [
      {
        "name": "Heroic Billow",
        "description": "Command the cloak to billow dramatically, enhancing your presence and charisma."
      },
      {
        "name": "Wind Independence",
        "description": "Billows perfectly regardless of actual wind conditions."
      }
    ]
  },
  {
    "name": "Hat of Disguise",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Spy networks, actor guilds, disguise kit vendors, thieves' markets",
    "description": "This unremarkable hat can transform into any style of headwear and subtly alters the wearer's facial features to create convincing disguises. The magic is subtle enough to fool casual observation.<br><br><strong>Mechanics:</strong> While wearing this hat, you can use an action to cast disguise self at will. The spell ends if the hat is removed.",
    "properties": {
      "Spell": "Disguise Self at will",
      "Duration": "Until hat is removed",
      "Transformation": "Hat changes to match disguise"
    },
    "abilities": [
      {
        "name": "Perfect Disguise",
        "description": "Cast disguise self at will while wearing the hat."
      },
      {
        "name": "Adaptive Headwear",
        "description": "Hat automatically transforms to match your chosen disguise."
      }
    ]
  },
  {
    "name": "Sending Stones (Pair)",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Communication networks, merchant caravans, military outposts, mage colleges",
    "description": "These two smooth stones are carved from the same piece of mineral and maintain a mystical connection across any distance. They enable instant communication between holders, making them invaluable for coordinating activities.<br><br><strong>Mechanics:</strong> While holding one stone, you can use an action to cast the sending spell to the holder of the other stone. Each stone can be used once per day, and the spell only works between the paired stones.",
    "properties": {
      "Communication Range": "Unlimited distance",
      "Daily Uses": "Once per stone per day",
      "Paired Connection": "Only works between the two stones"
    },
    "abilities": [
      {
        "name": "Instant Messaging",
        "description": "Send a 25-word message instantly to the holder of the paired stone."
      },
      {
        "name": "Planar Communication",
        "description": "Works even across different planes of existence."
      }
    ]
  },
  {
    "name": "Immovable Rod",
    "type": "Rod",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Engineering workshops, construction sites, puzzle dungeons, utility vendors",
    "description": "This flat iron rod has a small button on one end. When the button is pressed, the rod becomes magically fixed in place, defying gravity and remaining absolutely stationary until the button is pressed again.<br><br><strong>Mechanics:</strong> As an action, you can press the button to fix the rod in place. It hovers in the air and can support up to 8,000 pounds. Another action pressing the button releases it.",
    "properties": {
      "Weight Capacity": "8,000 pounds",
      "Activation": "Action to activate/deactivate",
      "Positioning": "Fixes in exact position in space"
    },
    "abilities": [
      {
        "name": "Absolute Position",
        "description": "Becomes completely immovable when activated, defying gravity."
      },
      {
        "name": "Heavy Load Bearer",
        "description": "Can support tremendous weight while activated."
      }
    ]
  },
  {
    "name": "Eversmoking Bottle",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Alchemist shops, siege equipment stores, military supply depots",
    "description": "This brass bottle contains compressed smoke from the Elemental Plane of Air. When uncorked, it releases a thick cloud of harmless but obscuring smoke that provides excellent cover for tactical maneuvers.<br><br><strong>Mechanics:</strong> As an action, you can remove the stopper and create a 20-foot radius sphere of thick smoke centered on the bottle. The smoke lasts for 1 hour or until dispersed by wind. The bottle can be used once per day.",
    "properties": {
      "Smoke Radius": "20-foot sphere",
      "Duration": "1 hour",
      "Daily Use": "Once per day"
    },
    "abilities": [
      {
        "name": "Tactical Concealment",
        "description": "Create a large area of thick smoke for cover and concealment."
      },
      {
        "name": "Harmless Smoke",
        "description": "Smoke blocks vision but doesn't cause damage or breathing problems."
      }
    ]
  },
  {
    "name": "Alchemy Jug",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Alchemist laboratories, tavern supply rooms, magical convenience stores",
    "description": "This ceramic jug appears unremarkable, but it can produce a variety of liquids on command. The jug seems to draw these substances from elemental planes and pocket dimensions.<br><br><strong>Mechanics:</strong> You can speak the jug's command word and name one liquid from its list to produce up to 2 gallons per day. Liquids include water, wine, beer, oil, vinegar, and various other common substances.",
    "properties": {
      "Daily Production": "2 gallons total",
      "Liquid Variety": "Multiple useful substances",
      "Command Activation": "Speak liquid name to produce"
    },
    "abilities": [
      {
        "name": "Liquid Production",
        "description": "Produce various useful liquids including water, oil, wine, and vinegar."
      },
      {
        "name": "Daily Renewal",
        "description": "Regains the ability to produce liquids each dawn."
      }
    ]
  },
  {
    "name": "Bag of Holding",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Adventuring supply stores, magical storage facilities, dimensional merchants",
    "description": "This appears to be a common cloth sack about 2 feet by 4 feet in size. The bag opens into a nondimensional space that is larger inside than outside, providing convenient storage for adventuring gear.<br><br><strong>Mechanics:</strong> The bag can hold up to 500 pounds, not exceeding a volume of 64 cubic feet. The bag weighs 15 pounds, regardless of its contents. Retrieving an item requires an action.",
    "properties": {
      "Weight Capacity": "500 pounds",
      "Volume": "64 cubic feet",
      "Bag Weight": "15 pounds regardless of contents"
    },
    "abilities": [
      {
        "name": "Extradimensional Storage",
        "description": "Store far more than the bag's apparent size should allow."
      },
      {
        "name": "Weight Reduction",
        "description": "Contents don't add to the bag's weight beyond the base 15 pounds."
      }
    ]
  },
  {
    "name": "Driftglobe",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Illumination specialists, underground exploration suppliers, magical lighting stores",
    "description": "This small glass sphere contains swirling luminescent gas that responds to verbal commands. It can provide light and even float freely, making it an excellent hands-free light source for adventurers.<br><br><strong>Mechanics:</strong> Speaking the command word causes it to shed bright light in a 20-foot radius and dim light for another 20 feet. You can command it to float and follow you. Saying 'daylight' causes it to cast the daylight spell once per day.",
    "properties": {
      "Light Radius": "20 feet bright, 20 feet dim",
      "Mobility": "Can float and follow commands",
      "Daylight Spell": "Once per day"
    },
    "abilities": [
      {
        "name": "Floating Illumination",
        "description": "Provides hands-free light that follows you around."
      },
      {
        "name": "Daylight Burst",
        "description": "Cast daylight spell once per day for intense illumination."
      }
    ]
  },
  {
    "name": "Decanter of Endless Water",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Desert survival suppliers, ship provisioning stores, agricultural magic vendors",
    "description": "This stoppered flask sloshes when shaken, as if it contains water. The decanter weighs 2 pounds and connects to an endless reservoir on the Elemental Plane of Water.<br><br><strong>Mechanics:</strong> You can use an action to remove the stopper and speak one of three command words: 'Stream' produces 1 gallon of water, 'Fountain' produces 5 gallons, and 'Geyser' produces 30 gallons that can knock creatures prone.",
    "properties": {
      "Stream": "1 gallon per action",
      "Fountain": "5 gallons per action",
      "Geyser": "30 gallons with knockdown force"
    },
    "abilities": [
      {
        "name": "Unlimited Water",
        "description": "Produce fresh water in varying quantities on command."
      },
      {
        "name": "Pressurized Blast",
        "description": "Geyser mode can knock down creatures with water pressure."
      }
    ]
  },
  {
    "name": "Boots of the Winterlands",
    "type": "Boots",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Arctic exploration outfitters, cold weather gear vendors, northern settlements",
    "description": "These furred boots are snug and feel quite warm. While wearing them, you gain resistance to cold damage, and cold weather doesn't impose any drawbacks on your travel or survival.<br><br><strong>Mechanics:</strong> Resistance to cold damage. You ignore difficult terrain created by ice or snow, and you can tolerate temperatures as low as −50 degrees Fahrenheit without protection.",
    "properties": {
      "Cold Resistance": "Half damage from cold",
      "Weather Immunity": "No penalties from cold weather",
      "Ice Walking": "Ignore ice and snow difficult terrain"
    },
    "abilities": [
      {
        "name": "Arctic Adaptation",
        "description": "Completely comfortable in extreme cold and resistant to cold damage."
      },
      {
        "name": "Sure Ice Footing",
        "description": "Move normally across ice and snow without slipping or slowing."
      }
    ]
  },
  {
    "name": "Cloak of Protection",
    "type": "Cloak",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Protective gear vendors, guardian temples, military quartermaster stores",
    "description": "This fine cloak is woven with protective wards and blessed by benevolent spirits. It shimmers faintly with defensive magic that turns aside attacks and bolsters the wearer's natural defenses.<br><br><strong>Mechanics:</strong> While wearing this cloak, you gain a +1 bonus to AC and saving throws.",
    "properties": {
      "AC Bonus": "+1 to Armor Class",
      "Save Bonus": "+1 to all saving throws",
      "Universal Protection": "Applies to all defense types"
    },
    "abilities": [
      {
        "name": "Defensive Ward",
        "description": "Provides a constant protective bonus to both AC and saving throws."
      },
      {
        "name": "Universal Aegis",
        "description": "Protection applies against all forms of attacks and harmful effects."
      }
    ]
  },
  {
    "name": "Winged Boots",
    "type": "Boots",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Aerial courier services, mountain climbing suppliers, sky temple gift shops",
    "description": "These leather boots have small wings attached at the heels that flutter and beat when activated. They grant the wearer the power of flight for limited periods, though they require rest between uses.<br><br><strong>Mechanics:</strong> While wearing these boots, you can use a bonus action to gain a flying speed of 30 feet for 4 hours. The flying speed becomes 0 if you exceed the weight limit of 300 pounds. You can use this feature once per day.",
    "properties": {
      "Flying Speed": "30 feet for 4 hours",
      "Weight Limit": "300 pounds maximum",
      "Daily Use": "Once per long rest"
    },
    "abilities": [
      {
        "name": "Temporary Flight",
        "description": "Gain the ability to fly for several hours once per day."
      },
      {
        "name": "Weight Restriction",
        "description": "Flight fails if you exceed the maximum weight capacity."
      }
    ]
  },
  {
    "name": "Periapt of Health",
    "type": "Amulet",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Healing temples, disease prevention clinics, medical supply vendors",
    "description": "This amulet is carved from a single piece of pristine jade and blessed by deities of health and purity. It provides robust protection against diseases and poisons that would otherwise harm the wearer.<br><br><strong>Mechanics:</strong> While wearing this amulet, you are immune to contracting any disease. If you are already diseased when you don it, the effects are suppressed until you remove it.",
    "properties": {
      "Disease Immunity": "Cannot contract diseases",
      "Effect Suppression": "Existing diseases dormant while worn",
      "Permanent Protection": "No daily limit"
    },
    "abilities": [
      {
        "name": "Disease Ward",
        "description": "Complete immunity to all forms of disease while wearing the amulet."
      },
      {
        "name": "Purifying Presence",
        "description": "Suppresses the effects of existing diseases without curing them."
      }
    ]
  },
  {
    "name": "Gloves of Swimming and Climbing",
    "type": "Gloves",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Athletic equipment stores, explorer outfitters, aquatic gear specialists",
    "description": "These leather gloves have webbing between the fingers and tiny hooks embedded in the palms. They enhance the wearer's natural climbing and swimming abilities to superhuman levels.<br><br><strong>Mechanics:</strong> While wearing these gloves, your climbing speed and swimming speed are equal to your walking speed, and you gain a +5 bonus to Strength (Athletics) checks made to climb or swim.",
    "properties": {
      "Climbing Speed": "Equal to walking speed",
      "Swimming Speed": "Equal to walking speed",
      "Athletics Bonus": "+5 to climb/swim checks"
    },
    "abilities": [
      {
        "name": "Enhanced Mobility",
        "description": "Move at full speed while climbing or swimming."
      },
      {
        "name": "Superior Grip",
        "description": "Significant bonus to all climbing and swimming athletic checks."
      }
    ]
  },
  {
    "name": "Ring of Mind Shielding",
    "type": "Ring",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Mental protection specialists, anti-telepathy vendors, privacy consultants",
    "description": "This simple band of metal contains intricate mental wards that protect the wearer's thoughts from intrusion. It provides immunity to magical attempts to read or influence the mind.<br><br><strong>Mechanics:</strong> You are immune to any effect that would sense your emotions, read your thoughts, or determine your location by divination magic. If you die while wearing this ring, your soul enters it and can communicate telepathically with any creature wearing it.",
    "properties": {
      "Thought Protection": "Immune to mind reading",
      "Emotion Shield": "Immune to emotion sensing",
      "Divination Block": "Immune to magical location"
    },
    "abilities": [
      {
        "name": "Mental Fortress",
        "description": "Complete protection against telepathic intrusion and mind-affecting divination."
      },
      {
        "name": "Soul Sanctuary",
        "description": "Upon death, soul can reside in the ring and communicate with future wearers."
      }
    ]
  },
  {
    "name": "Pearl of Power",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes (by a spellcaster)",
    "suggestedLevel": "1-4",
    "location": "Arcane academies, spell component suppliers, magical energy vendors",
    "description": "This lustrous pearl contains concentrated magical energy that can restore a spellcaster's expended power. It glows faintly when touched by someone with magical ability.<br><br><strong>Mechanics:</strong> While holding this pearl, you can use an action to speak its command word and regain one expended spell slot of 3rd level or lower. Once used, the pearl can't be used again until the next dawn.",
    "properties": {
      "Spell Recovery": "Regain one spell slot",
      "Maximum Level": "3rd level or lower",
      "Daily Use": "Once per day"
    },
    "abilities": [
      {
        "name": "Magical Restoration",
        "description": "Restore an expended spell slot once per day."
      },
      {
        "name": "Energy Condensation",
        "description": "Contains concentrated magical energy in a portable form."
      }
    ]
  },
  {
    "name": "Stone of Good Luck",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Gambling houses, luck charm vendors, fortune teller shops",
    "description": "This polished stone seems to shimmer with favorable fortune. While in your possession, it subtly nudges probability in your favor, making beneficial outcomes slightly more likely.<br><br><strong>Mechanics:</strong> While this stone is on your person, you gain a +1 bonus to ability checks and saving throws.",
    "properties": {
      "Ability Check Bonus": "+1 to all ability checks",
      "Save Bonus": "+1 to all saving throws",
      "Passive Effect": "Always active while carried"
    },
    "abilities": [
      {
        "name": "Fortune's Favor",
        "description": "Constant bonus to ability checks and saving throws while carried."
      },
      {
        "name": "Probability Nudge",
        "description": "Subtly influences random chance in the bearer's favor."
      }
    ]
  },
  {
    "name": "Folding Boat",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Nautical supply stores, transportation specialists, magical convenience vendors",
    "description": "This small wooden box transforms into a full-sized boat when activated. The transformation is nearly instantaneous and the boat is sturdy enough for ocean travel.<br><br><strong>Mechanics:</strong> You can use an action to speak the command word and unfold the box into a boat 10 feet long, 4 feet wide, and 2 feet deep. It can hold up to four Medium creatures comfortably. Speaking the command word again folds it back into a box.",
    "properties": {
      "Boat Size": "10x4x2 feet when expanded",
      "Capacity": "4 Medium creatures",
      "Transformation Time": "Instant activation"
    },
    "abilities": [
      {
        "name": "Instant Vessel",
        "description": "Transform from a small box into a fully functional boat."
      },
      {
        "name": "Compact Storage",
        "description": "Easily portable when folded, taking up minimal space."
      }
    ]
  },
  {
    "name": "Necklace of Adaptation",
    "type": "Amulet",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Environmental gear suppliers, survival equipment stores, planar travel agencies",
    "description": "This necklace features a pendant made from crystallized air that allows the wearer to breathe normally in any environment. It's invaluable for underwater exploration or traveling through toxic atmospheres.<br><br><strong>Mechanics:</strong> While wearing this necklace, you can breathe normally in any environment, and you have advantage on saving throws made against harmful gases and vapors.",
    "properties": {
      "Universal Breathing": "Breathe in any environment",
      "Gas Resistance": "Advantage vs harmful vapors",
      "Environmental Protection": "No suffocation risk"
    },
    "abilities": [
      {
        "name": "Atmospheric Adaptation",
        "description": "Breathe normally underwater, in toxic air, or in airless environments."
      },
      {
        "name": "Vapor Ward",
        "description": "Enhanced resistance to poisonous gases and harmful atmospheric effects."
      }
    ]
  },
  {
    "name": "Ledger of Honest Accounts",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Merchant guilds, accounting firms, tax collection offices, honest trader shops",
    "description": "This leather-bound ledger keeps perfect records of all financial transactions conducted near it. The pages fill themselves with precise accounting information, and the book can detect attempts at financial fraud or deception.<br><br><strong>Mechanics:</strong> All monetary transactions within 30 feet are automatically recorded. When reviewing transactions, you can detect if any party was attempting to deceive about money, prices, or trade goods. The ledger shows true values of items.",
    "properties": {
      "Auto-Recording": "Records all nearby transactions",
      "Fraud Detection": "Reveals deceptive pricing",
      "True Value": "Shows actual worth of goods"
    },
    "abilities": [
      {
        "name": "Perfect Bookkeeping",
        "description": "Automatically maintains accurate financial records of all nearby transactions."
      },
      {
        "name": "Deception Detection",
        "description": "Reveals when someone is lying about prices, values, or financial matters."
      }
    ]
  },
  {
    "name": "Scales of Fair Trade",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Merchant scales vendors, fair trade organizations, honest weight inspectors",
    "description": "These ornate brass scales are enchanted to always show the true weight and value of items placed upon them. They cannot be fooled by illusions, transmutation magic, or clever counterfeits.<br><br><strong>Mechanics:</strong> The scales show the exact weight and true value of any item placed on them. They can see through illusions that would disguise an item's nature and reveal if items are magically altered or counterfeit.",
    "properties": {
      "True Weight": "Shows exact, unmodified weight",
      "Value Assessment": "Reveals actual monetary worth",
      "Illusion Immunity": "Sees through disguise magic"
    },
    "abilities": [
      {
        "name": "Honest Measurement",
        "description": "Provides accurate weight and value assessment immune to magical deception."
      },
      {
        "name": "Counterfeit Detection",
        "description": "Instantly identifies fake or magically altered goods."
      }
    ]
  },
  {
    "name": "Coin Purse of Endless Change",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Banking institutions, money changer shops, merchant convenience stores",
    "description": "This leather coin purse always contains the exact change needed for any transaction, converting between different denominations of currency automatically. It never runs out of small coins for making change.<br><br><strong>Mechanics:</strong> The purse can break down larger denominations into smaller ones without limit. It always provides exact change for any transaction up to the total value of coins placed inside it. The purse doesn't create money, only converts it.",
    "properties": {
      "Denomination Exchange": "Converts large coins to small",
      "Exact Change": "Always has perfect change amounts",
      "No Money Creation": "Only converts existing coins"
    },
    "abilities": [
      {
        "name": "Perfect Change Making",
        "description": "Always provides exact change for any transaction from existing coin value."
      },
      {
        "name": "Currency Conversion",
        "description": "Automatically converts between different coin denominations as needed."
      }
    ]
  },
  {
    "name": "Display Case of Preservation",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Luxury shops, museum supply vendors, preservation specialists, high-end retailers",
    "description": "This elegant glass display case keeps items in perfect condition indefinitely while making them clearly visible to customers. Items inside never decay, tarnish, or lose their quality, maintaining their appeal forever.<br><br><strong>Mechanics:</strong> Items placed inside are preserved in perfect condition and cannot deteriorate. The case provides a +5 bonus to the perceived value of displayed items for sale purposes and prevents theft (DC 20 Investigation to find the hidden lock).",
    "properties": {
      "Perfect Preservation": "Items never decay or deteriorate",
      "Value Enhancement": "+5 bonus to sale price perception",
      "Theft Protection": "Hidden lock (DC 20 to find)"
    },
    "abilities": [
      {
        "name": "Eternal Preservation",
        "description": "Keep displayed items in perfect, unchanging condition forever."
      },
      {
        "name": "Enhanced Appeal",
        "description": "Items appear more valuable and desirable when displayed inside."
      }
    ]
  },
  {
    "name": "Register of Customer Memory",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Customer service training centers, hospitality suppliers, memory enhancement vendors",
    "description": "This ornate book automatically records information about every customer who enters the shop. It helps shopkeepers remember preferences, purchase history, and important details about their clientele.<br><br><strong>Mechanics:</strong> The book records basic information about anyone who enters your shop including appearance, name (if given), and purchases made. You can recall any customer's information perfectly and gain advantage on Charisma checks with repeat customers.",
    "properties": {
      "Customer Database": "Records all customer interactions",
      "Perfect Recall": "Remember any past customer details",
      "Relationship Bonus": "Advantage with repeat customers"
    },
    "abilities": [
      {
        "name": "Customer Tracking",
        "description": "Automatically record and recall information about every customer."
      },
      {
        "name": "Personal Service",
        "description": "Enhanced ability to provide personalized service to returning customers."
      }
    ]
  },
  {
    "name": "Shopkeeper's Apron of Many Pockets",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Merchant clothing suppliers, utility gear vendors, shopkeeper essentials stores",
    "description": "This practical canvas apron has an seemingly impossible number of pockets, each enchanted to hold exactly what the shopkeeper needs at any given moment. Tools, samples, and small items appear when needed.<br><br><strong>Mechanics:</strong> The apron has 20 extradimensional pockets. You can pull any mundane item worth 1 gp or less from a pocket as a bonus action, 3 times per day. The apron also provides resistance to damage from spilled substances.",
    "properties": {
      "Pocket Count": "20 extradimensional pockets",
      "Item Retrieval": "Mundane items up to 1 gp",
      "Spill Protection": "Resistance to substance damage"
    },
    "abilities": [
      {
        "name": "Convenient Storage",
        "description": "Pull needed tools and small items from pockets as a bonus action."
      },
      {
        "name": "Workplace Protection",
        "description": "Resistance to damage from common shop hazards and spills."
      }
    ]
  },
  {
    "name": "Bell of Customer Alerting",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "no",
    "suggestedLevel": "1-4",
    "location": "Shop fixture suppliers, customer service equipment vendors, small business essentials",
    "description": "This brass bell chimes melodically whenever a potential customer approaches the shop, even alerting to their general mood and intent. It helps shopkeepers provide appropriate service levels.<br><br><strong>Mechanics:</strong> The bell rings when anyone approaches within 60 feet with intent to enter or conduct business. The tone indicates the visitor's general disposition: cheerful for friendly, somber for serious business, sharp for hostile intent.",
    "properties": {
      "Detection Range": "60 feet",
      "Intent Reading": "Indicates customer mood",
      "Automatic Function": "No activation required"
    },
    "abilities": [
      {
        "name": "Customer Detection",
        "description": "Alerts when potential customers approach with different tones for different moods."
      },
      {
        "name": "Mood Indicator",
        "description": "Tone reveals whether approaching person is friendly, serious, or hostile."
      }
    ]
  },
  {
    "name": "Inventory Crystal of Tracking",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "yes",
    "suggestedLevel": "5-10",
    "location": "Magical inventory systems, large merchant operations, warehouse management suppliers",
    "description": "This multifaceted crystal hovers near the ceiling of a shop and tracks the location and quantity of every item in the inventory. It provides real-time updates on stock levels and can locate any specific item instantly.<br><br><strong>Mechanics:</strong> The crystal knows the location and quantity of every item in a building up to 10,000 square feet. You can mentally query it to find any specific item instantly. It alerts you when stock runs low (below 10% of normal levels).",
    "properties": {
      "Coverage Area": "10,000 square feet",
      "Real-time Tracking": "Knows location of every item",
      "Low Stock Alerts": "Warns at 10% remaining"
    },
    "abilities": [
      {
        "name": "Perfect Inventory",
        "description": "Track exact location and quantity of every item in your shop."
      },
      {
        "name": "Instant Location",
        "description": "Find any specific item immediately through mental query."
      }
    ]
  },
  {
    "name": "Contracts of Binding Agreement",
    "type": "Wondrous Item",
    "rarity": "Rare",
    "attunement": "no",
    "suggestedLevel": "5-10",
    "location": "Legal document suppliers, contract law firms, merchant protection services",
    "description": "This portfolio contains blank contracts that magically enforce their terms once signed by all parties. The contracts prevent violations and ensure fair dealing in business transactions.<br><br><strong>Mechanics:</strong> Once a contract is signed, all parties are compelled to follow its terms (Wisdom save DC 15 to resist taking actions that would violate the contract). The contract glows if someone attempts to break it, and violations cause psychic discomfort.",
    "properties": {
      "Binding Force": "Wisdom DC 15 to violate terms",
      "Violation Detection": "Contract glows when broken",
      "Psychic Deterrent": "Discomfort from breaking terms"
    },
    "abilities": [
      {
        "name": "Magical Enforcement",
        "description": "Compel parties to honor signed agreements through magical compulsion."
      },
      {
        "name": "Breach Warning",
        "description": "Immediately detect when someone attempts to violate contract terms."
      }
    ]
  },
  {
    "name": "Counting Frame of Rapid Calculation",
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "attunement": "yes",
    "suggestedLevel": "1-4",
    "location": "Accounting tool vendors, mathematical instrument shops, efficiency consultants",
    "description": "This ornate abacus performs complex calculations instantly and helps with all forms of mathematical business operations. The beads move on their own to show results and prevent calculation errors.<br><br><strong>Mechanics:</strong> The counting frame performs any mathematical calculation instantly and accurately. You gain advantage on Intelligence checks related to mathematics, accounting, or financial planning. It can calculate complex inventory values, taxes, and profit margins automatically.",
    "properties": {
      "Instant Calculation": "Any math problem solved immediately",
      "Error Prevention": "Cannot make calculation mistakes",
      "Business Math": "Specializes in commercial calculations"
    },
    "abilities": [
      {
        "name": "Mathematical Mastery",
        "description": "Perform complex business calculations instantly without error."
      },
      {
        "name": "Financial Analysis",
        "description": "Advantage on all mathematical and accounting-related Intelligence checks."
      }
    ]
  }
]