[
  {
    "name": "The Whitmore Estate Murders",
    "levelRange": "4-6",
    "partySize": "4-6",
    "type": "Mystery/Horror",
    "preview": "Three impossible murders at a fog-shrouded estate reveal a nobleman's dark descent into necromancy...",
    "description": "When three guests are found dead under impossible circumstances at the remote Whitmore Estate, the party must unravel a web of secrets, forbidden research, and supernatural horror. This investigation-heavy adventure combines classic detective work with D&D's supernatural elements, as the characters discover that grief-stricken Lord Whitmore's attempts to resurrect his dead son have unleashed forces beyond his control. Featuring locked-room mysteries, hidden laboratories, and a climactic confrontation with the undead, this adventure emphasizes roleplay and deduction over combat while delivering genuine chills and meaningful choices.",
    "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/90d5b874d50ce97eacd02c6da69db5b22dc24c29/Adventures/The%20Whitmore%20Estate%20Murders.pdf"
  },
  {
    "name": "The Corvid's Curse",
    "levelRange": "5-7",
    "partySize": "4-6", 
    "type": "Gothic Horror",
    "preview": "In Ravenshollow, a murder of crows speaks with voices of the dead, driving villagers to madness...",
    "description": "When grief-stricken druid Mordecai Blackfeather tears the veil between life and death, thousands of crows become conduits for the voices of the deceased. In the Gothic horror tradition, this atmospheric adventure emphasizes psychological terror over combat as the party investigates a village where corvids whisper impossible secrets and reveal truths that shatter minds. Players must unravel the mystery of the corrupted druid circle, confront their own mortality through conversations with the dead, and choose between multiple resolution paths that each carry profound moral weight. Features rich atmospheric descriptions, extensive NPC dialogue, sanity mechanics, and multiple endings ranging from redemption to divine intervention.",
    "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/90d5b874d50ce97eacd02c6da69db5b22dc24c29/Adventures/The%20Corvids%20Curse.pdf"
  },
    {
    "name": "Ravenscroft",
    "levelRange": "5-7",
    "partySize": "4-6",
    "type": "Mystery/Horror",
    "preview": "Uncover the haunted legacy of the Ravenscroft family in a dark, gothic mystery where secrets whisper from the shadows...",
    "description": "In Ravenscroft: Whispers of the Forgotten, a party of brave adventurers is drawn to a fog-shrouded coastal town steeped in sorrow and superstition. At its heart looms the Ravenscroft Mansion—a decaying estate filled with arcane relics, restless spirits, and a cursed family secret buried deep beneath its foundations. As players explore its haunted halls, decipher cryptic clues, and face twisted horrors born of grief and ambition, they must unravel the truth behind the Soulshard Amulet before it falls into darker hands. This level 3 adventure blends gothic horror and magical mystery, perfect for those who love atmospheric storytelling and unraveling the secrets of the dead.",
    "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/9832c97969d8600783362c063239d8036edc7573/Adventures/Ravenscroft.pdf
  },
 {
  "name": "The Gilded Conspiracy",
  "levelRange": "6-8",
  "partySize": "4-6",
  "type": "Urban/Political Intrigue",
  "preview": "In the golden city of Aurelius, missing persons return as perfect—but inhuman—versions of themselves...",
  "description": "A sophisticated urban adventure that plunges players into the political heart of Aurelius, a magnificent city where wealth and corruption intertwine. When the desperate begin disappearing from the lower districts only to return as eerily perfect versions of themselves, the party uncovers a conspiracy that reaches the highest levels of government. This investigation-heavy adventure features complex faction politics, moral ambiguity, and body horror as players navigate between noble houses, merchant guilds, and a sinister cult seeking to transform humanity itself. With detailed city districts, extensive NPC interactions, and multiple resolution paths, players must prevent a mass transformation that would remake every citizen into golden perfection—but at the cost of their humanity.",
  "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/b76e1917293269bfa6de9515861fe9327e1894a0/Adventures/The%20Gilded%20Conspiracy.pdf"
 },
{
  "name": "The Sundered Crown",
  "levelRange": "7-9",
  "partySize": "4-6",
  "type": "Political/Cultural",
  "preview": "The ancient dwarven crown lies shattered, and without its unifying power, the seven great clans fracture while ancient evils stir below...",
  "description": "A deep dive into dwarven politics and culture as the party navigates the complex relationships between seven great clans in the underground kingdom of Khaz Ankor. When the legendary Crown of Mountain Kings shatters during a clan dispute, its seven sacred gems scatter across the realm, taking with them the magical unity that has held the kingdom together for millennia. Players must prove themselves worthy of each clan's trust through trials that test the core dwarven virtues: Honor, Courage, Wisdom, Industry, Loyalty, Faith, and Unity. As ancient seals weaken and forgotten enemies stir in the depths, the party races against time to restore not just a crown, but the very soul of dwarven civilization. Features rich cultural immersion, political intrigue, meaningful moral choices, and a climactic restoration ritual that brings together all seven clans.",
  "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/c7b2cf620a44f4f5d2185af25b89efda0ca7a96a/Adventures/The%20Sundered%20Crown.pdf"
},
{
  "name": "The Goblin County Fair",
  "levelRange": "1-3",
  "partySize": "3-6",
  "type": "Comedy/One-Shot",
  "preview": "Magical chaos erupts at the annual goblin county fair when enchanted attractions run amok...",
  "description": "A delightful one-shot adventure perfect for new players or groups seeking lighthearted fun. When young goblin inventor Pipkin supercharges the county fair's magical generator with experimental pixie dust, carnival attractions come to life with chaotic results. Players must rescue fairgoers from a carousel of bucking wooden horses, navigate a funhouse maze of interdimensional mirrors, battle sentient pies in a food fight gone wrong, and prevent superpowered strongmen from accidentally destroying everything. This adventure emphasizes creative problem-solving over combat, offers multiple solutions to each challenge, and rewards heroic thinking with memorable moments. Features colorful NPCs, escalating magical mayhem, and a satisfying resolution that lets heroes enjoy the restored fair festivities.",
  "downloadUrl": "https://raw.githubusercontent.com/northernfoxgames/json/2ef7239b33e66c12cdb6bb7af8ec7f234fe10f7c/Adventures/The%20Goblin%20County%20Fair.pdf"
}
]
